

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	
	ПутьКФормам         = ЭтаОбработка.Метаданные().ПолноеИмя() + ".Форма.";
	
	ВФ = Истина;
	ОбновитьЗначенияСуществующихРеквизитов     = Истина;
	ДобавитьНовыеРеквизитыШапки                = Истина;
	АктивизацияНовыхРеквизитов                 = 0;
	
	ДобавитьНовыеТабличныеЧасти                = Истина;
	АктивизацияНовыхТЧ                         = 0;
	ДобавитьНовыеРеквизитыСуществующихТЧ       = Истина;
	АктивизацияНовыхРеквизитовТЧ               = 0;
	
	ДобавитьНовыеДвижения                      = Истина;
	АктивизацияНовыхДвижений                   = 0;
	ДобавитьНовыеРеквизитыСуществующихДвижений = Истина;
	АктивизацияНовыхРеквизитовДвижений         = 0;
	
	Элементы.СтраницаРеквизиты.Видимость = Параметры.ОтображатьСтраницуРеквизитов;
	Элементы.СтраницаТЧ.Видимость        = Параметры.ОтображатьСтраницуТЧ;
	Элементы.СтраницаДвижения.Видимость  = Параметры.ОтображатьСтраницуДвижений;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.АктивизацияНовыхРеквизитов.Доступность         = ДобавитьНовыеРеквизитыШапки;
	Элементы.АктивизацияНовыхТЧ.Доступность                 = ДобавитьНовыеТабличныеЧасти;
	Элементы.АктивизацияНовыхРеквизитовТЧ.Доступность       = ДобавитьНовыеРеквизитыСуществующихТЧ;
	Элементы.АктивизацияНовыхДвижений.Доступность           = ДобавитьНовыеДвижения;
	Элементы.АктивизацияНовыхРеквизитовДвижений.Доступность = ДобавитьНовыеРеквизитыСуществующихДвижений;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СцТ_ПринудительноеЗакрытиеВсехФормОбработки" Тогда
		Модифицированность = Ложь;
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	ОбновитьЗначенияСуществующихРеквизитов     = Истина;
	ДобавитьНовыеРеквизитыШапки                = Истина;
	АктивизацияНовыхРеквизитов                 = 0;
	
	АктивизацияСуществующихТЧ                  = 0;
	ДобавитьНовыеТабличныеЧасти                = Истина;
	АктивизацияНовыхТЧ                         = 0;
	ДобавитьНовыеРеквизитыСуществующихТЧ       = Истина;
	АктивизацияНовыхРеквизитовТЧ               = 0;
	
	АктивизацияСуществующихДвижений            = 0;
	ДобавитьНовыеДвижения                      = Истина;
	АктивизацияНовыхДвижений                   = 0;
	ДобавитьНовыеРеквизитыСуществующихДвижений = Истина;
	АктивизацияНовыхРеквизитовДвижений         = 0;
	
	Элементы.АктивизацияНовыхРеквизитов.Доступность         = ДобавитьНовыеРеквизитыШапки;
	Элементы.АктивизацияНовыхТЧ.Доступность                 = ДобавитьНовыеТабличныеЧасти;
	Элементы.АктивизацияНовыхРеквизитовТЧ.Доступность       = ДобавитьНовыеРеквизитыСуществующихТЧ;
	Элементы.АктивизацияНовыхДвижений.Доступность           = ДобавитьНовыеДвижения;
	Элементы.АктивизацияНовыхРеквизитовДвижений.Доступность = ДобавитьНовыеРеквизитыСуществующихДвижений;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ДобавитьНовыеРеквизитыШапки"               , ДобавитьНовыеРеквизитыШапки);
	Результат.Вставить("ОбновитьЗначениеСуществующихРеквизитов"    , ОбновитьЗначенияСуществующихРеквизитов);
	Результат.Вставить("АктивизацияНовыхРеквизитов"                , АктивизацияНовыхРеквизитов);
	
	Результат.Вставить("АктивизацияСуществующихТЧ"                 , АктивизацияСуществующихТЧ);
	Результат.Вставить("ДобавитьНовыеТабличныеЧасти"               , ДобавитьНовыеТабличныеЧасти);
	Результат.Вставить("АктивизацияНовыхТЧ"                        , АктивизацияНовыхТЧ);
	Результат.Вставить("ДобавитьНовыеРеквизитыСуществующихТЧ"      , ДобавитьНовыеРеквизитыСуществующихТЧ);
	Результат.Вставить("АктивизацияНовыхРеквизитовТЧ"              , АктивизацияНовыхРеквизитовТЧ);
	
	Результат.Вставить("АктивизацияСуществующихДвижений"           , АктивизацияСуществующихДвижений);
	Результат.Вставить("ДобавитьНовыеДвижения"                     , ДобавитьНовыеДвижения);
	Результат.Вставить("АктивизацияНовыхДвижений"                  , АктивизацияНовыхДвижений);
	Результат.Вставить("ДобавитьНовыеРеквизитыСуществующихДвижений", ДобавитьНовыеРеквизитыСуществующихДвижений);
	Результат.Вставить("АктивизацияНовыхРеквизитовДвижений"        , АктивизацияНовыхРеквизитовДвижений);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы_Шапка

&НаКлиенте
Процедура ДобавитьНовыеРеквизитыШапкиПриИзменении(Элемент)
	
	Элементы.АктивизацияНовыхРеквизитов.Доступность = ДобавитьНовыеРеквизитыШапки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыеТабличныеЧастиПриИзменении(Элемент)
	
	Элементы.АктивизацияНовыхТЧ.Доступность = ДобавитьНовыеТабличныеЧасти;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыеРеквизитыСуществующихТЧПриИзменении(Элемент)
	
	Элементы.АктивизацияНовыхРеквизитовТЧ.Доступность = ДобавитьНовыеРеквизитыСуществующихТЧ;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыеДвиженияПриИзменении(Элемент)
	
	Элементы.АктивизацияНовыхДвижений.Доступность = ДобавитьНовыеДвижения;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыеРеквизитыСуществующихДвиженийПриИзменении(Элемент)
	
	Элементы.АктивизацияНовыхРеквизитовДвижений.Доступность = ДобавитьНовыеРеквизитыСуществующихДвижений;
	
КонецПроцедуры


#КонецОбласти
