#Область Переменные

&НаКлиенте
Перем ОсновноеОкно Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения = НСтр("ru = 'Указанный порт (%1) занят тестируемым приложением
		|""%2"".
		|Подключиться к существующему приложению?'");
	ТекстСообщения = СтрЗаменить(
		ТекстСообщения,
		"%1",
		СтрЗаменить(Строка(Параметры.ПортТестируемогоКлиента), Символ(160), ""));
	ТекстСообщения = СтрЗаменить(
		ТекстСообщения,
		"%2",
		Параметры.ЗаголовокОкнаПриложения);
	Элементы.ДекорацияВопрос.Заголовок = ТекстСообщения;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СцТ_ПринудительноеЗакрытиеВсехФормОбработки" Тогда
		Модифицированность = Ложь;
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура АктивизироватьГлавноеОкно(Команда)
	
	Попытка
		ОсновноеОкно.Активизировать();
	Исключение
		ПоказатьПредупреждение(, НСтр("ru = 'Ошибка при попытке активизировать основное окно обнаруженного тестируемого приложения.
			|'") + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкиЗапуска(Команда)
	
	ВозвращаемаяСтруктура = Новый Структура;
	ВозвращаемаяСтруктура.Вставить("РежимЗапуска"       , "ИзменитьНастройкиЗапуска");
	
	Закрыть(ВозвращаемаяСтруктура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяКСуществующему(Команда)
	
	ВозвращаемаяСтруктура = Новый Структура;
	ВозвращаемаяСтруктура.Вставить("РежимЗапуска"       , "ПодключитьСуществующий");
	
	Закрыть(ВозвращаемаяСтруктура);
	
КонецПроцедуры


#КонецОбласти
